system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-0.5 -0.3 -0.1)
    ( 0.3 -0.3 -0.1)
    ( 0.3  0.3 -0.1)
    (-0.5  0.3 -0.1)
    (-0.5 -0.3  0.5)
    ( 0.3 -0.3  0.5)
    ( 0.3  0.3  0.5)
    (-0.5  0.3  0.5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (24 20 33) simpleGrading (1 1 1)
//    hex (0 1 2 3 4 5 6 7) (70 60 60) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (6 2 3 7)
            (0 1 5 4)
        );
    }
    down
    {
	type wall;
	faces
	(
	    (0 3 2 1)
	);
    }
    top
    {
        type patch;
        faces
        (
            (4 7 6 5)
        );

    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type wall;
        faces
        (
            (2 6 5 1)
        );
    }
);

// ************************************************************************* //
