constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1584;
        startFace       272163;
    }
    down
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2568;
        startFace       273747;
    }
    top
    {
        type            patch;
        nFaces          480;
        startFace       276315;
    }
    inlet
    {
        type            patch;
        nFaces          660;
        startFace       276795;
    }
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2502;
        startFace       277455;
    }
)

// ************************************************************************* //
