system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward;
}

gradSchemes
{
    default         Gauss linear;
//    grad(p)         cellLimited Gauss linear 1;
//    grad(U)         cellLimited Gauss linear 1;
}

divSchemes
{
    default         none;
//    div(phi,U)      Gauss upwind;
    div(phi,U)      Gauss GammaV 1;//filteredLinearM 1 0.85;//linearUpwind grad(U);
    div(phi,k)      Gauss Minmod;
    div(phi,epsilon) Gauss upwind;
    div(phi,omega) Gauss Minmod;
    div(phi,nuTilda) Gauss Minmod;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited corrected 0.33;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited corrected 0.33;
}

wallDist
{
    method meshWave;
}


// ************************************************************************* //
