system/elementData
// Blade element data
// axialDistance, radius, azimuth, chord, chordMount, twist
(0.0    0.01      0.0     0.020145    0.25     -53.52825213)
//(0.0    0.0125    0.0     0.021561    0.25     -47.78742891)
(0.0    0.015     0.0     0.022977    0.25     -42.04660568)
//(0.0    0.0175    0.0     0.024267    0.25     -38.06068033)
(0.0    0.02      0.0     0.025557    0.25     -34.07475497)
//(0.0    0.0225    0.0     0.02673     0.25     -31.2468816)
(0.0    0.025     0.0     0.027903    0.25     -28.41900823)
//(0.0    0.0275    0.0     0.0289515   0.25     -26.34573941)
(0.0    0.03      0.0     0.03        0.25     -24.27247059)
//(0.0    0.0325    0.0     0.030879    0.25     -22.70247107)
(0.0    0.035     0.0     0.031758    0.25     -21.13247156)
//(0.0    0.0375    0.0     0.032391    0.25     -19.90911358)
(0.0    0.04      0.0     0.033024    0.25     -18.6857556)
//(0.0    0.0425    0.0     0.033411    0.25     -17.70895)
(0.0    0.045     0.0     0.033798    0.25     -16.7321444)
//(0.0    0.0475    0.0     0.033831    0.25     -15.93590126)
(0.0    0.05      0.0     0.033864    0.25     -15.13965812)

