system/forces
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forces
{
    type          forces;

    libs          (forces);

    log           yes;
    
    writeControl  timeStep;
    writeInterval  100;

    patches       (hub);
    rho           rhoInf;     // Indicates incompressible
    log           true;
    rhoInf        1000;          // Redundant for incompressible

    CofR          (0 0 0);    // Rotation around centre line of propeller
    pitchAxis     (1 0 0);
}

forceCoeffs1
{
    type            forceCoeffs;
    libs            (forces);

    log           yes;
    
    writeControl  timeStep;
    writeInterval  100;
    
    patches         (propeller);
    p               p;
    U               U;
    rho             rhoInf;      // Indicates incompressible
    log             true;
    rhoInf          1;           // Required when rho = rhoInf
    liftDir         (0 1 0);
    dragDir         (1 0 0);
    CofR            (0 0 0);  // Axle midpoint on ground
    pitchAxis       (1 0 0);
    magUInf         1;
    lRef            1;          // Wheelbase length
    Aref            0.002002;          // Estimated

}


// ************************************************************************* //
